import React from "react";
import { View, Text, Platform, ScrollView } from "react-native";
import BaseTemplate from "../../templates/baseTemplate";
import { useRouter } from "next/router";
import MyStyleFunc, { styles, styleRow } from "../../../css/base_styles";
import { colorWhite, colorPrimary, colorSecondary } from "../../../connection/color";
import Icon from "react-native-vector-icons/FontAwesome5";
import IconFA from "react-native-vector-icons/FontAwesome";
import { Link, useRouting } from "expo-next-react-navigation";

var profileThis;
export default class Register extends React.Component {
  constructor(props) {
    super(props);

    this.state = {
      routeName: null,
    };
    profileThis = this;
  }

  componentDidMount() {
    this.setState(
      {
        routeName:
          Platform.OS == "web"
            ? routeName
            : this.props.navigation.state.routeName,
      },
      () => {
        // console.log(homeClassThis.state.routeName)
      }
    );
  }

  render() {
    return (
      <>
        <GetRouterName />
        <BaseTemplate routeName={this.state.routeName}>
          <View
            style={[
              { flex: 1, height: "100vh" },
              styles.justifyContentCenter,
              styles.alignItemsCenter,
            ]}
          >
            <RegistarBase />
          </View>
        </BaseTemplate>
      </>
    );
  }
}

var routeName = "";
function GetRouterName() {
  const router = useRouter();

  if (Platform.OS == "web") {
    routeName = router.pathname;
    routeName = routeName.split("/")[1];

    routeName == "" ? (routeName = "home") : routeName;
  }

  return <></>;
}

class RegistarBase extends React.Component {
  constructor(props) {
    super(props);
  }

  render() {
    return (
      <>
        <View
          onMouseEnter={() => this.forceUpdate()}
          style={[
            {
              position: "relative",
              flexDirection: "row-reverse",
              marginTop: 20,
              zIndex: 100,
            },
          ]}
        >
          <View style={[styleRow.outContainer]} />
          <View style={[styleRow.containerRegTermTab, styles.mdTabs]}>
            <View
              style={[
                { flex: 1, flexDirection: "row-reverse" },
                styles.justifyContentCenter,
                styles.mv4,
              ]}
            >
              {/* <Icon
                style={[{ color: colorWhite }, styles.pl3]}
                name="user-alt"
                size={30}
              /> */}

              <Text
                style={[
                  styles.textCenter,
                  { color: colorWhite },
                  styles.fontFa,
                  styles.font20,
                ]}
              >
                قوانین و مقررات استفاده از وبسایت
              </Text>
            </View>
          </View>
          <View style={[styleRow.outContainer]} />
        </View>

        <View
          onMouseEnter={() => this.forceUpdate()}
          style={[
            {
              position: "relative",
              flexDirection: "row-reverse",
              zIndex: 0,
            },
            styles.pv4,
          ]}
        >
          <View style={[styleRow.outContainer]} />
          <View onMouseEnter={() => this.forceUpdate()} style={[ styleRow.containerRegTerm]}>
            <View
              style={[{height: "60vh"},styles.cardReg, styles.pv4, { flexDirection: "column" }]}
            >
              <ScrollView>
                <Text style={[ styles.fontFa, styles.ph3, styles.textWhite, styles.textRight, styles. font12]}>
                  
                قوانین و مقررات استفاده از سایت
کاربر گرامی لطفاً موارد زیر را جهت استفاده بهینه از خدمات و برنامه‌‏های کاربردی دیجی‌کالا به دقت ملاحظه فرمایید.
ورود کاربران به وب‏‌سایت دیجی‌کالا هنگام استفاده از پروفایل شخصی، طرح‏‌های تشویقی، ویدئوهای رسانه تصویری دیجی‌کالا و سایر خدمات ارائه شده توسط دیجی‌کالا به معنای آگاه بودن و پذیرفتن شرایط و قوانین و همچنین نحوه استفاده از سرویس‌‏ها و خدمات دیجی‌کالا است. توجه داشته باشید که ثبت سفارش نیز در هر زمان به معنی پذیرفتن کامل کلیه شرایط و قوانین دیجی‌کالا از سوی کاربر است.
لازم به ذکر است شرایط و قوانین مندرج، جایگزین کلیه توافق‏‌های قبلی محسوب می‏‌شود.

قوانین عمومی
توجه داشته باشید کلیه اصول و رویه‏‌های دیجی‌کالا منطبق با قوانین جمهوری اسلامی ایران، قانون تجارت الکترونیک و قانون حمایت از حقوق مصرف کننده است و متعاقبا کاربر نیز موظف به رعایت قوانین مرتبط با کاربر است. در صورتی که در قوانین مندرج، رویه‏‌ها و سرویس‏‌های دیجی‌کالا تغییراتی در آینده ایجاد شود، در همین صفحه منتشر و به روز رسانی می شود و شما توافق می‏‌کنید که استفاده مستمر شما از سایت به معنی پذیرش هرگونه تغییر است.

تعریف مشتری یا کاربر
مشتری یا کاربر به شخصی گفته می‌شود که با اطلاعات کاربری خود که در فرم ثبت‌نام درج کرده است، به ثبت سفارش یا هرگونه استفاده از خدمات دیجی‌کالا اقدام کند.
همچنین از آنجا که دیجی‌کالا یک وب‌سایت خرده‌فروشی آنلاین است، طبق قانون تجارت الکترونیک مشتری یا مصرف کننده هر شخصی است که به منظوری جز تجارت یا شغل حرفه‌ای به خرید کالا یا خدمات اقدام می‌کند.

تعریف فروشنده و شرایط کالاهای فروشندگان
محصولات ارایه شده در وب‌سایت، یا توسط دیجی‌کالا از شرکت‌های معتبر و واردکنندگان رسمی و قانونی خریداری و عرضه می‌شود و یا برخی فروشندگان با دیجی‌کالا همکاری می‌کنند و محصولات خود را به‌واسطه این فروشگاه اینترنتی، به صورت آنلاین به فروش می‌رسانند. منظور از کالای فروشندگان، گروه دوم است و فروشنده، شخصی حقیقی یا حقوقی است که محصول خود را در وب‌سایت دیجی‌کالا عرضه کرده، به فروش می رساند. همچنین اعتبار فروشنده‌ها توسط دیجی‌کالا بررسی و مدارک مورد نیاز از ایشان اخذ می‌شود.
- مسئولیت‌های مربوط به کیفیت، قیمت، محتوا، شرایط و همچنین خدمات پس از فروش محصول بر عهده فروشندگان است.
- فاکتور کالاهایی که توسط فروشندگان در سایت عرضه می‌شود، در صورت درخواست خریدار توسط فروشنده ارسال می‌شود.
- خریداران حداکثر تا 2 روز بعد از ثبت سفارش و قطعی شدن آن، فرصت دارند درخواست ارسال فاکتور را ثبت کنند.
- سفارش‌هایی که دارای حداقل یک کالا از فروشندگان باشند و تا ساعت 16 هر روز کاری نهایی شوند ، حداقل 1 روز کاری بعد (طبق زمان تحویل اعلام‌شده در سایت) در تهران و شهرستان‌ها، ارسال خواهند شد.
- 1 روز کاری فاصله زمانی تحویل برای کالاهای فروشندگان، به معنای این است که در صورت خرید کالای فروشندگان ، شروع پردازش سفارش حداکثر 1 روز پس از زمان سفارش‌گذاری در دیجی‌کالا است.
- منظور از ۱ روز کاری، زمان آماده‌سازی و ارسال کالا به انبار دیجی‌کالا توسط فروشنده است، که امکان دارد این زمان بسته به نوع کالا تغییر یابد.
- در صورت بروز تاخیر در پردازش سفارش شما، این موضوع از طریق پیامک به شما اطلاع رسانی شده و دیجی­کالا تلاش خواهد کرد محصول/محصولات مورد نظر شما را ظرف ۲۴ ساعت تامین کند، درصورت عدم تامین کالا بعد از ۲۴ ساعت، اقلام در انتظار تامین سفارش شما بصورت سیستمی لغو خواهد شد.
- در شرایط خاص مثل فروش شگفت‌انگیز، احتمال لغو شدن سفارش مربوط به محصولات فروشندگان به دلایلی مانند اتمام موجودی کالا وجود دارد و دیجی‌کالا مجاز است بدون اطلاع قبلی نسبت به توقف سفارش‌‏گیری جدید، اقدام و فروش را متوقف کند.
- در صورتی‌که دیجی‌کالا تخفیف به شرط خرید تا سقف خاصی را اعلام کرد (Discount Voucher)، میزان خرید از کالاهای فروشندگان محاسبه نمی‌شود و این کالاها مشمول استفاده از این تخفیف‌ها نمی‌شوند.
- نحوه برگشت از فروش کالاهای فروشندگان طبق رویه دیجی‌کالا است، با این تفاوت که فروشنده مسئولیت هرگونه عدم مطابقت را به عهده می‌گیرد.
- به کالاهای فروشندگان تخفیف سازمانی تعلق نمی‌گیرد.
- خدمات پس ‌از‌ فروش دیجی‌کالا تنها درصورتی درخواست مشتری مبنی بر بازگرداندن کالای فروشندگان را می‌پذیرد که لیبل بارکد نارنجی رنگ که روی کالا نصب شده است، جدا نشده باشد.

ارتباطات الکترونیکی

هنگامی که شما از سرویس‌‏ها و خدمات دیجی‌کالا استفاده می‏‌کنید، سفارش اینترنتی خود را ثبت یا خرید می‏‌کنید و یا به دیجی‌کالا ایمیل می‏‌زنید، این ارتباطات به صورت الکترونیکی انجام می‏‌شود و در صورتی که درخواست شما با رعایت کلیه اصول و رویه‏‌ها باشد، شما موافقت می‌‏کنید که دیجی‌کالا به صورت الکترونیکی (از طریق پست الکترونیکی، سرویس پیام کوتاه و سایر سرویس‌های الکترونیکی) به درخواست شما پاسخ دهد.
همچنین آدرس ایمیل و تلفن‌هایی که مشتری در پروفایل خود ثبت می‌کند، تنها آدرس ایمیل و تلفن‌های رسمی و مورد تایید مشتری است و تمام مکاتبات و پاسخ‌های شرکت از طریق آنها صورت می‌گیرد.
جهت اطلاع‌رسانی رویدادها، خدمات و سرویس‌های ویژه یا پروموشن‌ها، امکان دارد دیجی‌کالا برای اعضای وب سایت ایمیل یا پیامک ارسال نماید. در صورتی که کاربران تمایل به دریافت اینگونه ایمیل و پیامک‌ها نداشته باشند، می‌توانند عضویت دریافت خبرنامه دیجی‌کالا را در پروفایل خود لغو کنند.
توجه داشته باشید که 300061930000 و 100061930000 تنها شماره‌‌هایی است که دیجی‌کالا از طریق آن برای کاربران و مشتریان خود پیامک (اس ام اس) ارسال می‌کند. همچنین این شماره‌‌ها سامانه ارسال پیامک است که وضعیت پردازش سفارش یا رویدادها، خدمات و سرویس‌های ویژه دیجی‌کالا را به اطلاع کاربران می‌رساند و روشن است که امکان دریافت پیام‌های شما از طریق آن وجود ندارد.
همچنین ممکن است دیجی‌کالا از طریق شماره 300061930002 برای برخی کاربران یا مشتریان خود، سوال نظرسنجی ارسال کند.
بنابراین ارسال هرگونه پیامک تحت عنوان دیجی‌کالا، با هر شماره دیگری تخلف و سوء استفاده از نام دیجی‌کالا است و در صورت دریافت چنین پیامکی، لطفاً جهت پیگیری قانونی آن را به Info@digikala.com اطلاع دهید.

سیاست‏‌های رعایت حریم شخصی
دیجی‌کالا به اطلاعات خصوصی اشخاصى که از خدمات سایت استفاده می‏‌کنند، احترام گذاشته و از آن محافظت می‏‌کند.
دیجی‌کالا متعهد می‏‌شود در حد توان از حریم شخصی شما دفاع کند و در این راستا، تکنولوژی مورد نیاز برای هرچه مطمئن‏‌تر و امن‏‌تر شدن استفاده شما از سایت را، توسعه دهد. در واقع با استفاده از سایت دیجی‌کالا، شما رضایت خود را از این سیاست نشان می‏‌دهید.
همه مطالب در دسترس از طریق هر یک از خدمات دیجی‌کالا، مانند متن، گرافیک، آرم، آیکون دکمه، تصاویر، ویدئوهای تصویری، موارد قابل دانلود و کپی، داده‌ها و کلیه محتوای تولید شده توسط دیجی‌کالا جزئی از اموال دیجی‌کالا محسوب می‏‌شود و حق استفاده و نشر تمامی مطالب موجود و در دسترس در انحصار دیجی‌کالا است و هرگونه استفاده بدون کسب مجوز کتبی، حق پیگرد قانونی را برای دیجی‌کالا محفوظ می‏‌دارد. علاوه بر این، اسکریپت‌ها، و اسامی خدمات قابل ارائه از طریق هر یک از خدمات ایجاد شده توسط دیجی‌کالا و علائم تجاری ثبت شده نیز در انحصار دیجی‌کالا است و هر گونه استفاده با مقاصد تجاری پیگرد قانونی دارد. کاربران مجاز به بهره‌‏برداری و استفاده از لیست محصولات، مشخصات فنی، قیمت و هر گونه استفاده از مشتقات وب‏‌سایت دیجی‌کالا و یا هر یک از خدمات و یا مطالب، دانلود یا کپی کردن اطلاعات با مقاصد تجاری، هر گونه استفاده از داده کاوی، روبات، یا روش‌‏های مشابه مانند جمع آوری داده‌‏ها و ابزارهای استخراج نیستند و کلیه این حقوق به صراحت برای دیجی‌کالا محفوظ است. در صورت استفاده از هر یک از خدمات دیجی‌کالا، کاربران مسئول حفظ محرمانه بودن حساب و رمز عبور خود هستند و تمامی مسئولیت فعالیت‌‏هایی که تحت حساب کاربری و یا رمز ورود انجام می‏‌پذیرد به عهده کاربران است. دیجی‌کالا محصولاتی مناسب استفاده افراد زیر 18 سال به فروش می‏‌رساند و در صورتی که کاربران از سن ذکر شده جوان‌‏تر هستند می‌‏باید با اطلاع والدین و یا قیم قانونی، به خرید و پرداخت اقدام کنند.
تنها مرجع رسمی مورد تایید ما برای ارتباط با شما، پایگاه رسمی این سایت یعنی www.digikala.com است. ما با هیچ روش دیگری جز ارسال نامه از طرف آدرس‏‌های رسمی و تایید شده در سایت، با شما تماس نمی‌‏گیریم. وب سایت دیجی‌کالا هیچگونه سایت اینترنتی با آدرسی غیر از www.digikala.com و همچنین، هیچ گونه وبلاگ و شناسه در برنامه‏‌های گفتگوی اینترنتی همچون Yahoo Messenger یا MSN Messenger و غیره ندارد و هیچ ‏گاه با این روش‏‌ها با شما تماس نمی‏‌گیرد. کاربران جهت برقراری ارتباط، تنها می‏‌توانند از آدرس‌‏های ذکر شده در بخش ارتباط با ما استفاده کنند.

ثبت، پردازش و ارسال سفارش
- روز کاری به معنی روز شنبه تا پنج شنبه هر هفته، به استثنای تعطیلات عمومی در ایران است و کلیه سفارش‏‌های ثبت شده در طول روزهای کاری و اولین روز پس از تعطیلات پردازش می‌‏شوند. دیجی‌کالا به مشتریان خود در 7 روز هفته و 24 ساعت در روز امکان سفارش‌‏گذاری می‌‏دهد.
- کلیه سفارش‌‏های ثبت شده در سایت دیجی‌کالا به وسیله ارسال کد سفارش از طریق پیام کوتاه و پیش فاکتور از طریق ایمیل، در صف پردازش قرار می‏‌گیرند. دیجی‌کالا همواره در ارسال و تحویل کلیه سفارش‌‏های ثبت شده، نهایت دقت و تلاش خود را انجام می‌دهد. با وجود این، در صورتی که موجودی محصولی در دیجی‌کالا به پایان برسد، حتی پس از اقدام مشتری به سفارش‌‏گذاری، حق کنسل کردن آن سفارش و یا استرداد وجه سفارش برای دیجی‌کالا محفوظ است و یا مشتری می‏‌تواند به جای کالای به اتمام رسیده، محصول دیگری را جایگزین کند.
- در صورت بروز مشکل در پردازش نهایی سبد خرید مانند اتمام موجودی کالا یا انصراف مشتری، مبلغ پرداخت شده طی 24 الی 48 ساعت کاری به حساب مشتری واریز خواهد شد.
- دیجی‌کالا مجاز است بدون اطلاع قبلی نسبت به توقف سفارش‌‏گیری جدید، اقدام و فروش خود را متوقف کند و کلیه سفارش‌‏های ثبت شده قبل از توقف سفارش‌‏گیری، پردازش و ارسال می‌‏شود. حق قطع فروش کلیه و یا بخشی از محصولات به هر دلیلی مانند اتمام موجودی کالا بدون اطلاع قبلی، برای دیجی‌کالا محفوظ است.
- در صورت بروز هرگونه خطا نسبت به درج قیمت و ارزش ریالی کالاهای موجود در سایت دیجی‌کالا، حق بلا اثر نمودن سفارش و خرید انجام شده توسط مشتری، برای دیجی‌کالا محفوظ است. دیجی‌کالا در اسرع وقت وجوه دریافتی را طی 24 الی 48 ساعت کاری به حساب اعلام شده توسط مشتری واریز و عودت می‌نماید و مشتری با ورود به سایت دیجی‌کالا می‌پذیرد از این امر آگاهی داشته و در این خصوص ادعایی نخواهد داشت.​
- کاربران باید هنگام سفارش کالای مورد نظر خود، فرم سفارش را با اطلاعات صحیح و به طور کامل تکمیل کنند. بدیهی است درصورت ورود اطلاعات ناقص یا نادرست، سفارش کاربر قابل پیگیری و تحویل نخواهد بود. بنابراین درج آدرس، ایمیل و شماره تماس‌های همراه و ثابت توسط مشتری، به منزله مورد تایید بودن صحت آنها است و در صورتی که این موارد به صورت صحیح یا کامل درج نشده باشد، دیجی‌کالا جهت اطمینان از صحت و قطعیت ثبت سفارش می‌تواند از مشتری، اطلاعات تکمیلی و بیشتری درخواست کند.همچنین، مشتریان می‌توانند نام، آدرس و تلفن شخص دیگری را برای تحویل گرفتن سفارش وارد کنند و اگر مبلغ سفارش از پیش پرداخت شده باشد، تحویل گیرنده سفارش هنگام دریافت کالا باید کارت شناسایی همراه داشته باشد.
- کاربری هر مشتری شامل نام و نام خانوادگی باید با اطلاعات مدارک شناسایی مطابقت داشته باشد و در صورت عدم تطابق، فروشگاه‌‌های اینترنتی مجاز به ارائه خدمات به این گروه از مشتریان نخواهد بود. لذا خریداران محترم می بایست با ارائه تصویر کارت ملی خود و خرید از طریق کارت بانکی متعلق به شخص خریدار که با هویت سفارش دهنده در تطابق می باشد، اقدام به ثبت سفارش نمایند.
لازم به ذکر است که این امر به منظور جلوگیری از سواستفاده‌های احتمالی و مواردی نظیر جلوگیری از خرید با کارت‌های سرقت شده و موارد مشابه در نظر گرفته شده است.
- با توجه به ثبت سیستمی سفارش، به هیچ عنوان امکان صدور فاکتور مجدد یا تغییر مشخصات آن از جمله تغییر فاکتوری که به نام شخص حقیقی صادر شده، به نام شخص حقوقی وجود ندارد. بنابراین لازم است مشتریان هنگام ثبت سفارش، نسبت به این مساله دقت لازم را داشته باشند و اگر نیاز دارند که فاکتور به نام حقوقی برای آنها صادر شود، هنگام ثبت سفارش خود، با انتخاب گزینه " تکمیل اطلاعات حقوقی " و وارد کردن مشخصات سازمان موردنظر، برای خرید سازمانی و دریافت فاکتور رسمی اقدام کنند.
همچنین آدرسی که خریدار به عنوان آدرس تحویل‌گیرنده ثبت یا انتخاب می‌کند، در فاکتور درج خواهد شد و لازم است درخواست کنندگان فاکتور به نام شخص حقوقی هنگام ثبت سفارش به این نکته توجه کافی داشته باشند، چرا که تغییر آدرس درج شده روی فاکتور پس از پردازش و تایید سفارش، به هیچ عنوان امکان‌پذیر نخواهد بود.
- امکان پرداخت در محل برای سفارش‌هایی که از طریق باربری ارسال می‌شوند یا مبلغ آنها بیشتر از سی میلیون ریال است، وجود ندارد و لازم است پیش از ارسال، مبلغ اینگونه سفارش‌ها از طریق پرداخت کارت به کارت یا پرداخت اینترنتی تسویه شود.
- از آنجا که دیجی‌کالا یک وب‌سایت خرده‌فروشی آنلاین است، سفارش یک کالا به تعداد بالا، مغایر با هدف مصرف خریدار است، در صورت ثبت این مورد و یا سفارشاتی که با تعداد اقلام بالایی همراه هستند، لازم است پیش از ارسال، سفارش مشتریان ابتدا توسط دیجی‌کالا بررسی و در صورت تایید، پردازش گردد. در این موارد پرداخت وجه و تسویه، قبل از ارسال کالا الزامی است؛ درغیر اینصورت سفارشات با هماهنگی مشتری کنسل شده و در صورت واریز وجه، مبلغ پرداخت شده طی 24 الی 48 ساعت کاری به حساب مشتری عودت داده خواهد شد.
- تحویل سفارش در اماکن عمومی همچون کافه، کافی نت، رستوران، هتل و مانند آن امکان‌پذیر نیست و لازم است آدرس تحویل، دقیق و قابل استناد باشد
- در صورت خرید اعتباری (استفاده از کد تخفیف یا ووچر) پس از نهایی شدن سبد، از نظر قانونی امکان اعمال تغییر در سبد خرید، و تغییر مبلغ فاکتور به دلایل انصراف از خرید، حذف یا تغییر کالا یا تعداد کالا وجود ندارد و اگر مشتری درخواست هرگونه تغییری را داشته باشد، ووچر یا کد تخفیف باطل خواهد شد و امکان برگرداندن مبلغ آن وجود ندارد.
- در رابطه با سرویس تحویل اکسپرس فروشگاه اینترنتی دیجی‌کالا، سفارش درب اصلی ساختمان (منتهی به خیابان) تحویل داده می‌شود.
- لازم به ذکر است افزودن کالا به سبد خرید به معنی رزرو کالا نیست و هیچ گونه حقی را برای مشتریان ایجاد نمی‌کند. همچنین تا پیش از ثبت نهایی، هرگونه تغییر از جمله تغییر در موجودی کالا یا قیمت، روی کالای افزوده شده به سبد خرید اعمال خواهد شد. بنابراین به مشتریانی که تمایل و تصمیم به خرید قطعی دارند، به‌ویژه درباره کالاهای ارائه شده تحت عنوان شگفت‌انگیز که دارای محدودیت تعداد هستند، توصیه می‌شود در اسرع وقت سفارش خود را نهایی کنند تا با اتمام موجودی یا تغییر قیمتی کالاها روبرو نشوند. شایان ذکر است سفارش تنها زمانی نهایی می‌شود که کاربران کد سبد خرید (dkc) سفارش خود را دریافت کنند و بدیهی است که دیجی‌کالا هیچ‌گونه مسوولیتی نسبت به کالاهایی که در سبد خرید رها شده است، ندارد.

شرایط خریداری حواله خودرو
- لازم است مالک نهایی خودرو با خریدار (صاحب پروفایل) یکی باشد، بنابراین خودرو نباید با حساب کاربری شخص دیگری به جز مالک نهایی، خریداری شود.
- با ثبت سفارش و پرداخت وجه، پس از تایید پرداخت، حواله خرید برای خریدار (کاربر) صادر می‌شود و قرارداد خرید خودرو میان خریدار و فروشنده در حضور نماینده دیجی‌کالا و بصورت حضوری منعقد خواهد شد. حواله خرید در زمان انعقاد قرارداد خرید، توسط نماینده دیجی‌کالا بابت ثمن قرارداد به فروشنده ارائه خواهد شد.
- ذی‌نفع حواله کاربر است نه صاحب حساب واریز کننده وجه. ولی درصورتی‌که پس از خرید و پیش از انعقاد قرارداد، صاحب حساب بانکی به مالکیت کاربر اعتراض نماید و مراتب اعتراض را کتبا به دیجی‌کالا اطلاع دهد، وجه به حساب وی مسترد و سفارش لغو خواهد شد. پس از انعقاد قرارداد، نظر به اینکه مراقبت از اطلاعات حساب با صاحب آن است، دیجی‌کالا هیچ مسوولیتی را نمی‌پذیرد.
- درصورتی‌که به هر دلیل سفارش لغو شود، وجه به همان حساب اولیه‌ باز می‌گردد و در این‌صورت هیچ اعتراضی از سوی کاربر یا اشخاص دیگر پذیرفته نخواهد شد.
- تحویل خودرو فقط در شهر تهران صورت می‌گیرد.
- با توجه به محدودیت عرضه خودرو، در صورت قطعی نشدن سفارش، وجه پرداختی ظرف 24 ساعت به حساب مشتری مسترد می‌شود.

شرایط خریداری کارت هدیه
- با اولین استفاده، کارت هدیه در حساب کاربری ثبت می‌شود و امکان استفاده از آن برای دیگر کاربران وجود نخواهد داشت.
- لازم نیست تمام اعتبار (ریالی) کارت هدیه در اولین خرید، خرج شود. اعتبار کارت هدیه را می‌توان در چند سبد خرید مجزا استفاده کرد .
- امکان استفاده از دو یا چند کارت هدیه برای ثبت یک سفارش وجود ندارد.
- در صورت مرجوع کردن کالاهایی که با استفاده از اعتبار کارت هدیه خریداری شده، مبلغ آن‌ها به حساب همان کارت هدیه بازمی‌گردد.
- کارت هدیه قابل مرجوع کردن یا تعویض نیست .
- اعتبار کارت هدیه دیجی‌کالا قابل تبدیل به وجه نقد نیست .
- اگر مبلغ سفارش بیش از اعتبار کارت هدیه باشد، می‌توان باقی‌مانده را با روش‌های عادی پرداخت کرد.
- لازم است پس از خرید، کارت هدیه را مدتی نزد خود نگه دارید.

خسارت در هنگام حمل و نقل
دیجی‌کالا همواره نهایت تلاش خود را می‏‌کند تا کلیه سفارش‏‌ها در نهایت صحت و بدون آسیب به دست مشتریان خود در سراسر کشور برسد. با توجه به بسته‌بندی ایمن و استاندارد همه مرسولات، تحویل به هر یک از شرکت‌‏های حمل و نقل معتبر به انتخاب کاربر و اعلام بارنامه مرسوله (درج در سبد خرید و اطلاع رسانی از طریق سرویس پیام کوتاه) به این معنی است که بروز هر گونه حادثه در هنگام حمل و تحویل به عهده شرکت حمل و نقل است و دیجی‌کالا تنها در صورت تایید شرکت حمل کننده سفارش و در راستای تسهیل امور پیگیری، خسارت را جبران می‌‏کند.
آسیب‏‌های ناشی از حمل و نقل باید در عرض 24 ساعت کاری پس از تحویل سفارش به خدمات پس از فروش دیجی‌کالا اطلاع داده شود و کالای آسیب دیده به همراه صورت جلسه رسمی شرکت حمل کننده و کلیه متعلقات و فاکتور به خدمات پس از فروش دیجی‌کالا ارسال شود.
برای اطلاعات بیشتر به صفحه رویه‌های بازگرداندن کالا مراجعه کنید.

سرویس مهلت تست ۷ روزه دیجی‌کالا
در راستای ایجاد سرویس‌‏های ارزش افزوده، دیجی‌کالا با همکاری کلیه تامین‏‌ کنندگان خود این امکان را ایجاد نموده تا کلیه کالاهایی که نیاز به تست دارند، تا 7 روز پس از تحویل، دارای فرصت تست باشند و هر گونه نقص فنی در دستگاه شامل سرویس تعویض بدون قید و شرط و فراتر از سرویس گارانتی محصول، می‏‌شود. لازم به ذکر است که با توجه به گستردگی گروه‌های کالای ارایه شده در وب سایت دیجی‌کالا، کلیه محصولاتی که باید از نظر فیزیکی سالم به دست مصرف کننده برسند (مانند کالاهای گروه‌های کتاب و رسانه و اسباب بازی یا کالاهای مصرفی مانند کارتریج و جوهر چاپگر) دارای گارانتی سلامت فیزیکی هستند و مشمول 7 روز مهلت تست و بازگشت کالا نمی‌شوند.
همچنین عکس محصولات جهت اطلاع و کمک به خرید مشتری است و از آنجا که ممکن است در پاره ای جزییات با کالای اصلی تفاوت هایی داشته باشد به استناد آنها نمی توان اعلام مغایرت کرد. ملاک وجود مغایرت در مشخصات کالا، مشخصات فنی درج شده در وب سایت است.
لازم به توجه است که ایرادهای اعلام شده توسط مشتری، توسط کارشناسان خدمات پس از فروش دیجی‌کالا کنترل و بررسی می‏‌شود و در صورت تائید وجود نقص فنی، کالا مشمول استفاده از سرویس فوق می‏‌شود. همچنین، این سرویس، اشکال‏‌های فنی که در اثر استفاده نادرست کاربر از کالا ایجاد شود، را شامل نمی‌‏شود.
آسیب‏‌های فیزیکی ناشی از حمل و نقل شامل استفاده از این سرویس نمی‏‌شود و جهت اطلاع بیشتر شرایط مربوط به خسارت در هنگام حمل و نقل را مطالعه فرمایید.
برای استفاده از سرویس تضمین تعویض 7 روزه دیجی‌کالا، دقت فرمایید که کالا به ‏خوبی بسته‌بندی شود، لوازم جانبی و فاکتور به صورت کامل به همراه آن ارسال شود.
در صورتی که کالای برگشتی در شرایط اولیه خود توسط دیجی‌کالا دریافت نشود، امکان سرویس دهی وجود ندارد و کالا خارج از شرایط تعویض محسوب می شود.
در صورتی که موجودی کالای آسیب دیده در دیجی‌کالا به اتمام برسد، و دیجی‌کالا امکان تعویض کالای آسیب دیده با کالای جایگزین را نداشته باشد، می‌تواند مبلغ کالا را به حساب خریدار استرداد نماید و نوسان‏‌های قیمت باعث کاهش و یا افزایش این مبلغ نمی‌‏شود.

ضوابط و مسئولیت‌های مربوط به فروش محصولات آرایشی و بهداشتی,
- اطلاعات هر محصول آرایشی بهداشتی در وب‌سایت دیجی‌کالا، صرفاً برای اطلاع‌رسانی است و جنبه مشاوره ندارد. خریدار باید قبل از استفاده از مواد آرایشی بهداشتی نسبت به کسب اطلاعات حرفه‌ای و اخذ مشاوره از متخصص مربوط اقدام کند. همچنین،نظراتی که کاربران در خصوص کالا در وب­‌سایت درج کرده‌اند، تجربه یا اطلاعات شخصی افراد است و برای آنها و دیجی­‌کالا مسئولیتی ایجاد نمی‌کند. همچنین دیجی‌کالا مسئولیتی در قبال درستی اطلاعات فراهم شده روی بسته‌بندی کالا ندارد و مسئولیت آن با شرکت تولیدکننده کالاست.
- درصورت عدم آگاهی، اطلاع و ناتوانی مشتری در استفاده از محصولات آرایشی و بهداشتی و یا ایجاد خسارت نسبت به خود یا محصول، تمامی مسئولیت­‌های آن بر عهده مشتری است و فروشگاه دیجی‌کالا در این خصوص هیچگونه تعهدی نخواهد داشت.
- در صورت تایید معیوب بودن کالای مرجوعی توسط شرکت تامین یا تولیدکننده، دیجی‌کالا صرفا هزینه کالا یا سرویس را مطابق فاکتور (حداکثر تا یک ماه از تاریخ فاکتور) به مشتری برمی‌گرداند.
- دیجی‌کالا نسبت به عوارض جسمی و بیماری‌های ناشی از استفاده محصولات آرایشی و بهداشتی (از قبیل حساسیت‌های پوستی، جراحات و ...) مسئولیت و پاسخگویی ندارد. انجام پیگیری‌های لازم باید توسط مشتری و از طریق شرکت‌های مربوط ( نمایندگی‌ها و تامین‌کنندگان رسمی کالا) انجام شود.
برای اطلاعات بیشتر به صفحه رویه‌های بازگرداندن کالا مراجعه کنید.

نظرات کاربران
هدف از ایجاد بخش نظرات در دیجی‌کالا، اشتراک‌گذاری تجربه‌ی خرید و کاربری محصولاتی است که به فروش می‌رسد. بدیهی است بخش نظرات دیجی‌کالا با دیگر سایت‌ها و شبکه‌های اجتماعی متفاوت است. در این بخش، هر کاربر مجاز است در چهارچوب شرایط و قوانین سایت، نظرات خود را به اشتراک بگذارد و پس از بررسی کارشناسان تایید، نظرش را روی سایت مشاهده کند. بدیهی است که اگر قوانین سایت در نظرات کاربری رعایت نشود، تایید نمی‌شوند و در نتیجه در سایت به نمایش درنمی‌آیند. دیجی‌کالا در قبال درستی یا نادرستی نظرات منتشرشده در این قسمت، هیچ‌گونه مسئولیتی ندارد. نمایش نظرات کاربران در سایت به‌هیچ‌وجه به معنی تایید فنی دیجی‌کالا درباره‌ی محتویات نظر نیست؛ لذا از کاربران محترم تقاضا می‌شود، نظرات را اصل و پایه‌ی انتخاب و تصمیم‌گیری خود قرار ندهند.

شرایط و قوانین درج نظر در بخش نظرات کاربران
۱. فارسی بنویسید و از کیبورد فارسی استفاده کنید. بهتر است از فضای خالی (Space) بیش از حد معمول، کشیدن حروف یا کلمات، استفاده‌ی مکرر از یک حرف یا کلمه، شکلک و اموجی در متن خودداری کنید.
۲. برای نظر یا نقد و بررسی خود عنوانی متناسب با متن انتخاب کنید. یک عنوان خوب کاربران را برای خواندن نظر شما ترغیب خواهد کرد.
۳. نقد کاربران باید شامل قوت‌ها و ضعف‌های محصول در استفاده‌ی عملی و تجربه‌ی شخصی باشد و مزایا و معایب به‌صورت خلاصه و تیتروار در محل تعیین‌شده درج شود. لازم است تا حد ممکن از مبالغه و بزرگ‌نمایی مزایا یا معایب محصول خودداری کنید.
۴. نقد مناسب، نقدی است که فقط معایب یا فقط مزایا را در نظر نگیرد؛ بلکه به‌طور واقع‌بینانه معایب و مزایای هر محصول را در کنار هم بررسی کند.
۵. با توجه به تفاوت در سطح محصولات مختلف و تفاوت عمده در قیمت‌های آن‌ها، لازم است نقد و بررسی هر محصول با توجه به قیمت آن صورت گیرد؛ نه به‌صورت مطلق.
۶. جهت احترام‌گذاشتن به وقت بازدیدکنندگان سایت، لازم است هنگام نوشتن نقد، مطالب غیرضروری را حذف کرده و فقط مطالب ضروری و مفید را در نقدتان لحاظ کنید.
۷. با توجه به ساختار بخش نظرات، از سوال‌کردن یا درخواست راهنمایی در این بخش خودداری کرده و سوال یا درخواست راهنمایی خود را در بخش پرسش و پاسخ مطرح کنید.
۸. کاربران ارسال‌کننده‌ی نظر موظف‌اند از ادبیات محترمانه استفاده کرده و از توهین به دیگر کاربران یا سایر افراد پرهیز کنند. بدیهی است هرگونه توهین به فرد یا افراد و استفاده از کلمات نامناسب، باعث تاییدنشدن نظر کاربر می‌شود.
۹. قسمت نظرات سایت، با تالارهای گفت‌وگو (فروم) متفاوت است؛ لذا برای حفظ ساختار، مباحث خارج از چهارچوبی که حالت بحث و گفت‌وگو دارد، تایید نخواهد شد.
۱۰. تمام کاربران حق دارند نظرات خود را به شرط رعایت قوانین، در سایت منتشر کنند؛ لذا حتی اگر نظری را به دور از واقعیت، جانب‌دارانه یا اشتباه یافتید، نباید نظردهنده را مخاطب قرار دهید یا از وی انتقاد کنید. هر کاربر تنها می‌تواند نظر خود را عنوان کرده و قضاوت را به خوانندگان نظرات واگذار کند.
۱۱. از طریق نمودار تغییر قیمت در سایت می‌توانید از تغییرات قیمت آگاه شوید؛ لذا به‌هیچ‌وجه در بخش نظرات مبلغ «قیمت» را ذکر نکرده، درباره‌ی آن سؤال نکنید و نظری ندهید.
۱۲. در نظرات خود، از بزرگ‌نمایی یا اغراق درباره‌ی قوت‌ها یا ضعف‌های محصول خودداری کنید. بدیهی است تا حد ممکن هرگونه نظر مبالغه‌آمیز یا به دور از واقعیت تایید نخواهد شد.
۱۳. با توجه به مسئولیت سایت در قبال لینک‌های موجود در آن، نباید لینک سایت‌های دیگر را در نظرات خود ثبت کنید. دقت داشته باشید تا جای ممکن از هرگونه لینک‌دادن (فرستادن) دیگر کاربران به سایت‌های دیگر و درج ایمیل یا نام کاربری شبکه‌های اجتماعی خودداری کنید.
۱۴. تنها نظراتی تایید خواهند شد که مرتبط با محصول موردنظر باشند؛ لذا بحث‌های متفرقه و غیرمرتبط با محصول را مطرح نکنید.
۱۵. کاربران می‌توانند نقد خود به هر بخش از دیجی‌کالا را در قسمت مربوط اعلام کنند؛ لذا هیچ‌گونه نقدی را درباره‌ی سایت یا خدمات آن در قسمت نظرات ننویسید.
۱۶. توجه داشته باشند، مسائلی را که از آن اطمینان ندارید، به‌هیچ‌وجه در نظرات ثبت نکنید؛ همچنین از بازنشر شایعات یا اطلاعات غیرمطمئن درباره‌ی محصولات جدا خودداری کنید.
۱۷. بهتر است مطالبی در این بخش ثبت شود که برای بازدیدکنندگان سایت مفید باشد؛ لذا از بیان هرگونه مطالب شخصی، غیرمرتبط یا غیرضروری در این بخش پرهیز کنید.
۱۸. لازم است نظرات خود را به صورت نگارشی ثبت کرده و از کوتاه‌کردن کلمات یا استفاده از ادبیات محاوره تا جای ممکن خودداری کنید. استفاده از ادبیات نوشتاری که قابلیت نمایش در سایت را داشته باشد، لازمه‌ی تایید نظرات کاربران است.
۱۹. کامنت هایی که با عرف جامعه مغایر هستند مثل کامنت های کالاهای جنسی تایید نخواهند شد.

شرایط ارسال پرسش یا پاسخ:
- بهتر است پرسش و پاسخ کوتاه و مختصر باشد؛ زبان و رسم‌الخط فارسی و اسلوب نگارش هم در آن رعایت شده باشد.
- برای آگاهی از تغییرات قیمت از نمودار تغییر قیمت در سایت استفاده کنید و به‌هیچ‌وجه در بخش پرسش و پاسخ در مورد «قیمت» نپرسید.
- از پرسش و پاسخ درباره‌ی آدرس سایر فروشگاه‌های فیزیکی یا اینترنتی و استفاده از لینک خودداری کنید.
- پرسش خودتان را فقط یک بار و زیر محصول موردنظرتان بنویسید.
- از ثبت اطلاعات شخصی از قبیل ایمیل، شماره تماس و نام کاربری شبکه‌های اجتماعی در بخش پرسش و پاسخ پرهیز کنید.

توجه داشته باشید که نظر یا پرسش و پاسخ فقط باید در رابطه با کالا باشد، بنابراین برای پیگیری یا سوال درباره سفارش یا استفاده از خدمات پس از فروش با امور مشتریان دیجی‌کالا (شماره تلفن‌های ۶۱۹۳۰۰۰۰ یا ۹٥۱۱۹۰۹٥ – ۰۲۱) تماس بگیرید یا از طریق فرم صفحه "تماس با ما" با انتخاب موضوع پیگیری سفارش یا خدمات پس از فروش، سوال یا درخواست خود را مطرح کنید.
برای ارسال سایر درخواست‌ها یا پیشنهادها، انتقاد یا شکایت های خود نیز از فرم صفحه "تماس با ما" استفاده کنید یا به ایمیل آدرس info@digikala.com ایمیل ارسال کنید.

دیجی‌کلاب
باشگاه مشتریان دیجی‌کالا با هدف تداوم لذت خرید، رضایتمندی و قدردانی از مشتریان دیجی‌کالا ایجاد شده است. مشتریان می‌توانند با نام کاربری و رمز عبور حساب کاربری خود در دیجی‌کالا در دیجی کلاب هم عضو شوند و براساس فعالیت‌هایی از جمله خرید، ثبت نظر در خصوص کالای خریداری‌شده و دعوت از دوستان امتیاز جمع‌آوری کرده و از پیشنهادهای ویژه ارائه شده در دیجی‌کلاب بهره‌مند شوند.

قوانین دیجی‌کلاب (باشگاه مشتریان دیجی‌کالا)
- امتیاز خرید بعد از عضویت در دیجی‌کلاب محاسبه می‌شود. توجه داشته باشید به خریدهایی که قبل از عضویت در دیجی‌کلاب انجام داده‌اید، امتیازی تعلق نمی‌گیرد.
- پس از عضویت در دیجی‌کلاب و بعد از خریدهای موفق و نهایی از دیجی‌کالا که ۷ روز از تحویل سفارش گذشته باشد و سفارش مرجوع نشده باشد، به ازای هر ۱۰ هزار تومان خرید، یک امتیاز منظور خواهد شد. سقف امتیاز برای هر سبد خرید، ۱۵۰ امتیاز است.
- امتیاز ثبت نظر: به هر نظر تائید شده، پنج امتیاز به حساب کاربری که نظر را ثبت کرده است، تعلق خواهد گرفت. کالایی که ثبت در نظر در خصوص آن صورت می‌گیرد باید توسط مشتری خریداری شده باشد. نظر ثبت شده باید با قوانین "ثبت نظر" دیجی‌کالا منطبق باشد و پس از تایید نظر از طرف دیجی‌کالا، امتیاز در حساب کاربر منظور می‌شود. سقف امتیاز ثبت نظر، ۲۴۰ امتیاز در هر سال است.
- امتیاز دعوت از دوستان: هفت روز پس از اولین خرید موفق و قطعی دوست دعوت‌شده در دیجی کالا،به شرط عدم مرجوعی، ۲۰ امتیاز به دعوت‌کننده تعلق می‌گیرد. سقف امتیازات دعوت از دوستان ۳۰۰ امتیاز در سال است. برای دعوت از دوستان باید با استفاده از کد تخفیف مربوط به دعوت از دوستان که مختص هر کاربر است، دعوت انجام شود. امتیاز مربوط به این دعوت در صورتی به مشتری دعوت‌کننده تعلق می‌گیرد که دعوت‌شونده قبلا عضو دیجی‌کالا نبوده باشد و با استفاده از کد تخفیف، اولین خرید از سایت دیجی‌کالا را انجام دهد.

نحوه استفاده از امتیاز
- خرج امتیاز: پیشنهادهای متنوع دیجی‌کلاب از طریق ورود به حساب کاربری و مراجعه به قسمت جوایز قابل مشاهده است. در این قسمت می‌توانید به انتخاب خود، امتیاز کسب شده را برای هر یک از پیشنهادهای مطرح شده استفاده کنید.
- گفتنی است امتیازهای ذکر شده صرفا جهت استفاده از پیشنهادهای دیجی‌کلاب بوده و امکان نقد شدن ندارند. امتیاز استفاده شده و جایزه دریافت شده از دیجی‌کلاب به هیچ وجه قابل استرداد نخواهد بود.
- لازم به توضیح است جوایز دیجی‌کلاب ثابت و دائمی نیست و دیجی‌کلاب تعهدی بابت ثابت نگه داشتن این جوایز در طول زمان را ندارد.
- لازم به ذکر است تخصیص امتیازات قابل استفاده برای گرفتن جوایز دیجی‌کلاب هم از قواعد ثابت تبعیت نکرده و امکان تغییر آن برای دیجی‌کلاب محفوظ است.

روش استفاده از کدهای تخفیف
- کدهای تخفیف ارائه شده در دیجی‌کلاب دارای شرایط و قوانین منحصر به فرد است و برای استفاده از آنها باید شرایط مذکور در قسمت جزئیات کد تخفیف به طور کامل رعایت شود تا تخفیف مورد نظر برای کاربر در نظر گرفته شود.
- مهلت استفاده از هر کد تخفیف در صفحه مربوط به دریافت آن کد درج می‌شود. در صورت پایان تاریخ اعتبار، کدهای تخفیف قابل تمدید یا تعویض نیست و امتیاز آنها غیر قابل بازگشت خواهد بود.
- برای رعایت هر چه بیشتر امنیت کاربران، اگر یک کد تخفیف دیجی‌کالا از دیجی‌کلاب دریافت نمایید، کد تخفیف شما فقط در همان حساب کاربری که با آن کدتخفیف را دریافت کرده اید قابل استفاده است و در سایر حساب‌های کاربری امکان استفاده ندارد.
- کلیه امتیازهای کسب شده امسال تا پایان سال بعد معتبر است. یعنی امتیازهایی که در سال ۱۳۹۸ کسب شده، تا پایان سال ۱۳۹۹ معتبر بوده و پس از آن منقضی شده و غیر قابل بازگشت است.
- دیجی‌کلاب در حال حاضر فقط متعلق به اشخاص حقیقی است و حساب‌های کاربری حقوقی امکان استفاده از آن را ندارند. شایان ذکر است در صورت خرید شخص حقیقی به نام شخص حقوقی و درخواست صدور فاکتور حقوقی، امتیازی در دیجی‌کلاب به هیچ یک از این اشخاص بابت ثبت سفارش تعلق نخواهد گرفت.

قوانین قرعه کشی دیجی کلاب
- با خرج هر ۱۰ امتیاز ، یک شانس شرکت در قرعه‌کشی دریافت خواهید کرد که پس از دریافت، قابل بازگشت نیست. در این خصوص هیچ‌گونه محدودیتی در تعداد خرید شانس‌های قرعه‌کشی برای کاربران وجود ندارد.
- طی ۲۴ تا ۷۲ ساعت کاری پس از انجام قرعه کشی با برندگان تماس گرفته می‌شود و هماهنگی‌های لازم جهت تحویل جایزه به ایشان صورت می‌گیرد، تماس با برندگان قرعه‌کشی از طریق اطلاعات تماس ثبت شده توسط برندگان در حساب کاربری در وبسایت دیجی‌کالا انجام می‌شود. اسامی برندگان در قسمت  خبرنامه  در سایت دیجی‌کلاب هم اعلام خواهد شد.
- هر جایزه تا ۶۰ روز بعد از اعلام نتایج قرعه‌کشی برای برنده نگهداری می‌شود و در این بازه زمانی تیم دیجی‌کلاب برای اعطای آن با برنده تماس خواهد گرفت. چنانچه تماس‌ها ناموفق باشد و یا تا پایان موعد مقرر برنده برای دریافت جایزه اقدام نکند، همه حقوق مادی و معنوی مالکیت جایزه مذکور برای دیجی‌کلاب محفوظ خواهد بود.
- سایر شروط قرعه کشی و جوایز آن در پایین صفحه قرعه کشی دیجی کلاب اطلاع رسانی می‌شود.

شایان ذکر است دیجی کالا می تواند در هر زمان قوانین دیجی کلاب (باشگاه مشتریان دیجی کالا) را حسب صلاحدید خود به روز رسانی نماید و این موضوع را جهت آگاهی اعضای دیجی کلاب از طریق درج در همین صفحه و ارسال ایمیل یا پیامک به آنها اطلاع رسانی می نماید.

دیجی‌پلاس
تعریف دیجی‌پلاس
پلتفرم دیجی‌پلاس: پلتفرمی به منظور ایجاد امکان خرید اشتراک ماهانه از دیجی‌کالا برای مشتریان وب‌سایت دیجی‌کالا.
اشتراک‌ها به صورت ماهانه، فصلی و نیم سالانه تعریف می‌شوند. مشتریان در صورت خرید اشتراک می‌توانند از خدمات ویژه‌ای از جمله تحویل رایگان کالا، Cashback (هدیه نقدی که به کیف پول الکترونیک شما برمی‌گردد)، مهلت 30 روزه مرجوعی کالا، قرار گرفتن در اولویت اطلاع‌رسانی در مورد پیشنهادهای شگفت‌انگیز دیجی‌کالا و خرید آن و سایر مواردی که شرح آن در ادامه آمده است ، بهره‌مند شوند.


خدمات ارائه شده در دیجی‌پلاس
۱. ارسال رایگان:
اعضای دیجی‌پلاس می‌توانند برای همه سبدهای خرید خود به غیر از سبدهای خرید سوپرمارکتی (که با علامت سبز مشخص شده‌اند) و مرسوله‌های سنگین، از خدمات ارسال رایگان بهرمند شوند.
اعضای دیجی‌پلاس می‌توانند به ازای هر ماه اشتراک چهار ارسال رایگان بر روی سفارش‌های عادی استفاده کنند که مبلغ سفارش زیر سقف مبلغ ارسال رایگان طبق مقررات وب‌سایت دیجی‌کالا است و ارسال رایگان ندارد.
همه کاربران دیجی‌کالا می‌توانند به پلاس بپیوندند و از این تسهیلات که فقط مختص اعضای دیجی‌پلاس است، استفاده کنند.
۲. هدیه نقدی (Cashback):
اعضای دیجی‌پلاس از امتیاز بازپرداخت نقدی بخشی از مبلغ سبد خرید به کیف پول دیجی‌پی خود، در برخی خریدهای خود، بهره‌مند می‌شوند که این مبلغ پس از خرید نهایی کاربر عضو دیجی‌پلاس (در صورتی که کاربر کیف پول دیجی‌پی خود را فعال کرده باشد) در حساب کیف پول شارژ می‌شود و کاربر عضو می‌تواند پس از پایان مهلت 30 روزه مرجوعی کالا و در صورتی که کالای خریداری شده مرجوع نشده باشد، از این وجه استفاده کند.
۳. اولویت اطلاع‌رسانی و خرید از پیشنهادهای شگفت‌انگیز:
اعضای دیجی‌پلاس برای دسترسی به پیشنهادهای شگفت‌انگیز از اولویت زمانی 30 دقیقه‌ای بهره‌مند می‌شوند و همچنین می‌توانند به رویدادها و پیشنهادهای ویژه انحصاری دسترسی داشته باشند.
از آنجا که در دیجی‌کالا همه خریدهای کاربران در صورتی انجام خواهد شد که کالا موجود باشد، عضویت در دیجی‌پلاس تضمینی برای خرید کالا در صورت ناموجود بودن نیست و تعهدی برای دیجی‌کالا از این نظر ایجاد نمی‌کند. این موضوع به این معنا است که ممکن است قبل از پایان مدت دسترسی به کالاها به دلیل استقبال در خرید یا عوامل دیگر کالا ناموجود شود و عملاً غیرقابل سفارش باشد.
۴. پیشنهادهای شگفت‌انگیز اختصاصی دیجی‌پلاس:
به اعضای دیجی‌پلاس به صورت روزانه ، پنج محصول شگفت‌انگیز پیشنهاد می‌شود که این پیشنهادها برای کاربران عادی قابل خرید نیستند.
از آنجا که در دیجی‌کالا همه خریدهای کاربران در صورتی انجام خواهد شد که کالا موجود باشد، عضویت در دیجی‌پلاس تضمینی برای خرید کالا در صورت ناموجود بودن نیست و تعهدی برای دیجی‌کالا از این نظر ایجاد نمی‌کند. این موضوع به این معنا است که ممکن است قبل از پایان مدت دسترسی به کالاها به دلیل استقبال در خرید یا عوامل دیگر کالا ناموجود شود و عملاً غیرقابل سفارش باشد.
۵. ظرفیت ارسال اختصاصی دیجی‌پلاس:
اعضای دیجی‌پلاس می‌توانند از ظرفیت اختصاصی و اضافی زمان ارسال بهرمند شوند و ممکن است سبد خرید آنها در بازه‌های زمانی سریع‌تری که برای همه کاربران در دسترس نیست، ارسال شود.
۶. مهلت بازگشت کالا تا ۳۰ روز:
اعضای دیجی پلاس می توانند از ۳۰ روز مهلت بازگشت کالا بهره‌مند شوند. (شرایط بازگشت کالا به دیجی کالا)
این خدمت فقط مخصوص اعضای دیجی‌پلاس است.
۷. خط پشتیبانی ویژه اعضای دیجی‌پلاس:
اعضا در صورتی که با شماره تلفن‌های ثبت شده خود در دیجی‌پلاس، تماس بگیرند، می‌توانند از خط پشتیبانی ویژه اعضای دیجی‌پلاس استفاده کنند. برای بهره‌مندی از این خدمت، لازم است سفارش با حساب دیجی‌پلاس کاربر ثبت شده باشد.
۸. شش ماه ضمانت بیشتر در محصولات دارای گارانتی دیجی‌کالا که برای اطلاع می‌توانید در قسمت توضیحات گارانتی، توضیحات بیشتر را بخوانید.


مواردی که لازم است کاربر برای عضویت در دیجی‌پلاس بپذیرد:
۱. دیجی‌پلاس برای مشتریانی که محصولات را به منظور فروش یا ارسال برای مشتریان خود، خریداری می‌کنند، قابل استفاده نیست. درصورت نقض قوانین دیجی‌کالا، دیجی‌پلاس هیچگونه تعهدی برای بازگشت هزینه عضویت یا ارائه همه خدمات ویژه نخواهد داشت.
۲. شرایط و ضوابط دیجی‌پلاس قابل اصلاح و تغییر از جانب دیجی‌کالا است و لازم است کاربر در زمان تمدید عضویت اشتراک، قوانین و شرایط سایت و به روز رسانی‌ها را مجدد مطالعه و بررسی کند.
۳. امکان لغو عضویت دیجی پلاس از جانب دیجی کالا همراه با عودت وجه حق عضویت وجود خواهد داشت.
۴. در مورد برخی از سفارشات همچون سبدهای خرید سوپرمارکتی ( که با علامت سبز مشخص شده‌اند) و مرسوله‌های سنگین، امکان ارسال به صورت رایگان وجود ندارد. این خدمات شامل ارسال‌های اکسپرس خواهد بود.
۵. عضویت در دیجی‌پلاس مشمول مالیات است.
۶. حساب دیجی‌پلاس، تنها قابل استفاده برای یک نفر (حقیقی) است. تخطی از این قانون مشمول نقض قوانین است.
۷. عضویت دیجی‌پلاس قابل انتقال به غیر نیست.
۸. سرویس دیجی‌پلاس سرویسی ماهانه است و امتیازات یک ماه قابل انتقال به ماه بعد یا ماه قبل نیست. این موضوع شامل سرویس‌های بلند مدت هم خواهد بود.
۹. همه خدمات در مدت زمان عضویت فعال قابل استفاده است.
۱۰. عضویت آزمایشی: ارائه هرگونه سرویس آزمایشی رایگان یا با تخفیف به صلاحدید دیجی‌کالا است و دیجی‌کالا هیچگونه تعهدی برای ارائه سرویس آزمایشی رایگان یا با تخفیف به مشتریان خود ندارد.
۱۱. هزینه و تمدید عضویت: هزینه عضویت دیجی‌پلاس در صفحه دیجی پلاس قسمت "مشاهده اشتراک های دیجی پلاس" قابل مشاهده است. در مواردی ممکن است شرایط عضویت مختلفی ارائه شود و هزینه‌های عضویت به شکل‌های مختلف، متفاوت باشد. هزینه عضویت دیجی‌پلاس قابل استرداد نیست. (برای مثال ممکن است حق عضویت مشتری جدید دیجی‌پلاس با عضویت اعضای سابق متفاوت باشد.)
۱۲. تغییراتی در عضویت یا اصلاحات در شرایط دیجی‌پلاس: کاربر در مدت زمانی که از عضویت دیجی‌پلاس استفاده می کند، مشروط به شرایط و ضوابط استفاده از دیجی‌کالا و چارچوب حریم خصوصی آن خواهد بود. دیجی‌پلاس می‌تواند شرایط و ضوابط استفاده و چهارچوب حفظ حریم خصوصی یا هر جنبه‌ای از عضویت دیجی‌پلاس را در هر زمانی تغییر دهد. اگر هر یک از این شرایط یا هرگونه تغییر در این شرایط، نامعتبر، باطل یا به هر دلیلی غیرقابل اجرا باشد، قابل قبول تلقی می‌شود و تاثیری در اعتبار و شرایط باقی‌مانده نخواهد داشت. چنانچه هر یک از موارد ذکر شده به هر دلیلی باطل یا قابل اجرا نباشد، دلیل بر باطل شدن کل شرایط و ضوابط نیست. کاربر می‌تواند در صورتی که با شرایط و ضوابط جدید موافق نیست، عضویت خود را تمدید نکند، اما در صورت موافقت با شرایط جدید امکان ارتقای عضویت همچنان وجود خواهد داشت.
استفاده از سرویس پلاس تابع قوانین کشوری، دیجی‌کالا و دیجی‌پلاس است. درصورت هرگونه بروز تغییر در این قوانین، ادامه ارائه سرویس‌ها در زمان تمدید عضویت تابع قوانین جدید خواهند بود.


سایر محدودیت‌ها:
اشخاصی که به دلیلی حساب آنها توسط مراجع قضایی مسدود شده و یا قوانین را نقض کرده و مرتکب تخلف شوند، عضویت آنها لغو شده و ملزم به جبران خسارت وارد آمده به اشخاص ثالث هستند. لازم به ذکر است هزینه عضویت مرجوع نخواهد شد.
عضویت در سرویس دیجی‌پلاس منوط به تایید دیجی‌کالا است و دیجی‌کالا مجاز است بنا بر صلاحدید از عضویت برخی افراد جلوگیری کند.
تنظیمات مربوط به خبرنامه دیجی‌کالا، ارسال ایمیل دیجی‌پلاس را محدود نخواهد کرد و کاربر می‌تواند با تغییر تنظیمات خبرنامه دیجی‌کالا، همچنان ایمیل دیجی‌پلاس را دریافت کند. کاربر نمی‌تواند عضویت دیجی‌پلاس یا مزایای دیجی‌پلاس خود، از جمله کدهای تبلیغاتی برای عضویت یا مزایای دیجی‌پلاس را منتقل یا واگذار کند.
امتیاز دیجی‌پلاس مختص به اشخاص حقیقی است و اشخاص حقوقی و فروشندگان حق استفاده از این امتیاز را ندارند.
کاربران اصلی دیجی‌پلاس  مجاز به خرید محصولات با هدف فروش، اجاره یا ارسال کالا به مشتریان یا مشتریان بالقوه خود با استفاده از مزایای دیجی‌پلاس نیستند.
مزایای قابل استفاده یا ارائه شده در دیجی‌پلاس با حفظ شرایط موجود در دیجی‌کالا برقرار است. برای مثال محدودیت بازگرداندن کالاهایی با شرایط خاص همچنان وجود دارد و برخی کالاهای آرایشی، بهداشتی و خوراکی همچنان غیرقابل مرجوع کردن هستند. همچنین شرایط پیشنهادات شگفت‌انگیز همچنان وجود خواهد داشت.
دیجی‌کالا ممکن است به صلاحدید خود مزایا و هزینه عضویت دیجی‌پلاس را کم یا زیاد کند.


خاتمه/ فسخ عضویت:
دیجی‌کالا مجاز است بدون اطلاع قبلی عضویت در دیجی‌پلاس کاربران این سرویس را به صلاحدید خود لغو کند. در این صورت بر اساس تعداد ماه‌های کامل باقی‌مانده از عضویت کاربر، وجه عضویت بازپرداخت خواهد شد. در صورت بروز موارد نقض شامل این تعهدات یا هر قانون قابل اجرا، کلاهبرداری یا سوءاستفاده از عضویت یا آسیب و ضرر رساندن به دیجی‌کالا یا سایر کاربران، عضویت لغو می‌شود و هزینه آن مرجوع نخواهد شد.


قانون صالح:
این شرایط مطابق قوانین جمهوری اسلامی ایران اجرا و تفسیر می‌شود. در صورت بروز هرگونه اختلاف، ادعا، مغایرت یا مناقشه که به هر نحوی با شرایط قرارداد مرتبط باشد، از جمله این که مسئله مرتبط با عضویت کاربر در دیجی‌پلاس یا مربوط به کالا یا خدمات ارائه شده توسط دیجی‌کالا باشد یا موجودیت، اعتبار، تفسیر، اجرا، نقض یا خاتمه یا هرگونه اختلاف در رابطه با هرگونه تعهدات غیر قراردادی نشات گرفته از آنها، مراجع صالح، دارای صلاحیت رسیدگی به آن هستند. ( با قبول این شرایط حق مراجعه و شکایت رو از خود سلب و ساقط مینماید. )


محتوا
دیجی‌کالا نهایت تلاش و دقت را در راستای ارائه تمامی سرویس‌‏های خود می‏‌کند و به منظور تولید محتوا از منابع و مراجع اصیل و نیز شرکت‏‌های سازنده محصولات استفاده می‏‌کند. لازم به ذکر است دیجی‌کالا تضمین نمی‏‌کند که توصیفات محصول و یا دیگر مطالب مندرج در سایت عاری از خطا باشد. اگر محصول ارائه شده توسط دیجی‌کالا دارای هر گونه مغایرت با اطلاعات درج شده در سایت است تنها راه حل، استرداد کالا قبل از استفاده و در شرایط اولیه است.
وب ‏‌سایت دیجی‌کالا هیچ گونه مسوولیتی را در رابطه با حذف شدن صفحه‏‌های سایت خود و یا لینک‏‌های مرده نمی‌‏پذیرد. سروﻳس‌‏های سایت آن‏گونه که هست ارائه می‏‌شود و سایت دیجی‌کالا تحت هیچ شرایطی مسوولیت تاخیر یا عدم کارکرد سایت را که می‌تواند ناشى از عوامل طبیعى، نیروى انسانی، مشکلات اینترنتى، خرابی تجهیزات کامپیوترى، مخابراتى و غیره باشد بر عهده ندارد.
سایت دیجی‌کالا ممکن است دارای سرویس‌‏هایی با قابلیت مشارکت عمومی موسوم به سرویس‌‏های جمعی، همچون اتاق گفتگو، تابلوی اعلانات، تالار گفتگو، نقد، گروه‌‏های خبری، شبکه دوستان و سرویس‏‌های دیگری باشد که برای تسهیل ارتباط شما با دیگران (چه در مقیاس عمومی مثل تالار گفتگو و چه در مقیاس خصوصی مثل شبکه خصوصی دوستان) ارائه می‏‌شوند. شما توافق می‏‌کنید که از این سرویس‏‌های جمعی، فقط برای ثبت، ارسال و دریافت پیام‏‌هایی استفاده کنید که مناسب و مرتبط با آن سرویس خاص باشد.
 
© کلیه محتویات سایت دیجی‌کالا شامل قانون حق تکثیر شده و به سایت دیجی‌کالا تعلق دارد.

سیاست قیمت گذاری
سیاست قیمت‌‏گذاری در دیجی‌کالا مبتنی بر اصول مشتری مداری و احترام به حقوق مصرف کننده است. قیمت‏‌های ارائه شده برای کالاها در دیجی‌کالا قیمت‏‌های خرده فروشی است که غالباً توسط تولید‏کننده و یا تامین‏‌کننده آن محصول به صورت مصوب تعیین شده است و سایر کالاها بر اساس مدل و مشخصات و همچنین کالاهای مشابه در بازار تعیین قیمت می‌‏شوند.
با نهایت احترام به کاربران و با توجه به طیف گسترده سبد محصولات، دیجی‌کالا نمی‌تواند قیمت و موجودی نهایی کالاها را قبل از سفارش گذاری به صورت قطعی اعلام نماید. در مواردی بسیار نادر و در صورت وجود نوسان‌‏هایی در بازار و یا اشتباه در قیمت‌‏گذاری، اگر سفارشی قابل تحویل نباشد، دیجی‌کالا موظف است در اسرع وقت این موضوع را به فرد سفارش‌ ‏دهنده اطلاع دهد و سفارش را لغو نماید. لازم به ذکر است در صورتی که کالایی پس ثبت سفارش شامل کاهش قیمت شود، سفارش به روز رسانی و قیمت جدید اعمال می‏‌شود. قیمت کلیه محصولات با احتساب مالیات بر ارزش افزوده است و مشتری مبلغ جداگانه‌‏ای بابت مالیات و عوارض ارزش افزوده پرداخت نمی‏‌کند و هزینه‏‌های بسته‌بندی، ارسال و بیمه حمل کالا بسته به شرایط سفارش که در فرم سبد خرید اطلاع‌ ‏رسانی می‌‏شود، ممکن است جداگانه محاسبه شود.

طرح تشویقی پیشنهاد شگفت‌انگیز
طرح تشویقی شگفت‌انگیز به منظور ایجاد تجربه یک خرید خوب برای کاربران در نظر گرفته شده و روزانه در این بخش تعدادی از محصولات با تخفیف‏‌هایی بسیار ویژه‏‌تر نسبت به فروش‌‏های ویژه درج می‏‌شود که این کالاها تنها برای ساعت‏‌هایی امکان سفارش گذاری دارند. در مواردی که به دلیل استقبال کاربران موجودی کالا زودتر از موعد مقرر به پایان رسد، وضعیت کالا به ناموجود تغییر می‏‌کند و امکان سفارش گذاری وجود نخواهد داشت. در صورتی که کالایی در روز قبل از فروش شگفت‌انگیز به سبد خرید اضافه شود و در هنگام پردازش، کالا در طرح شگفت‌انگیز باشد، قیمت شگفت‌انگیز اعمال می‏‌شود. به دلیل اینکه این طرح تنها یک طرح تشویقی خرید (پروموشن) است، دیجی‌کالا تعهدی در قبال سفارش‌‏های تعدادی ندارد و در صورت امکان فروش تعدادی هماهنگی‌‏های لازم انجام می‏‌شود. همچنین، هرینه ارسال سفارش برای بخش شگفت‌انگیز به ازای هر سفارش به صورت مجزا و ثابت در نظر گرفته می‏‌شود و امکان تغییر ندارد.
نمایندگی
دیجی‌کالا در هیچ نقطه‏‌ای از کشور نمایندگی فروش و یا خدمات پس از فروش ندارد و کلیه سرویس‌‏ها و تراکنش‏‌های مالی از طریق دفتر مرکزی پردازش می‏‌شود. لطفاً در صورت مشاهده هر گونه تخلفی از این دست، مراتب را جهت پیگرد قانونی به روابط عمومی دیجی‌کالا اطلاع دهید.
در حال حاضر دیجی‌کالا در شهرهای تحت پوشش تحویل اکسپرس، تنها خدمات ارسال و تحویل سفارش را از طریق مراکز توزیع و پخش خود انجام می‌دهد و برای خرید تنها باید به وب سایت دیجی‌کالا مراجعه و سفارش خود را ثبت کرد.

قوه قهریه
تمامی شرایط و قوانین مندرج، در شرایط عادی قابل اجرا است و در صورت بروز هرگونه از موارد قوه قهریه، دیجی‌کالا هیچ گونه مسئولیتی ندارد.
دیجی‌کالا خود را ملزم به رعایت حریم شخصی کاربران می‌داند، لطفا در صورت مشاهده هرگونه تخلف، مراتب را از طریق کانال‏‌های ارتباطی ذکر شده با ما در میان بگذارید.

                </Text>
              </ScrollView>
            </View>
          </View>
          <View style={[styleRow.outContainer]} />
        </View>
      </>
    );
  }
}
